STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE_Thread/BLE_HeartRate_Thread_SED_FreeRTOS/STM32_WPAN/App/app_bsp.c
/**
  ******************************************************************************
  * @file    app_bsp.c
  * @author  MCD Application Team
  * @brief   Application to manage BSP.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "log_module.h"
#include "app_conf.h"
#include "app_bsp.h"
#include "main.h"

#include "stm32_rtos.h"
#include "stm32_timer.h"

/* Private includes -----------------------------------------------------------*/
#include "serial_cmd_interpreter.h"

/* Private typedef -----------------------------------------------------------*/
#if (CFG_BUTTON_SUPPORTED == 1)
typedef struct
{
  Button_TypeDef      button;
  UTIL_TIMER_Object_t longTimerId;
  uint8_t             longPressed;
  uint32_t            waitingTime;
} ButtonDesc_t;
#endif /* (CFG_BUTTON_SUPPORTED == 1) */

/* Private defines -----------------------------------------------------------*/
#if (CFG_BUTTON_SUPPORTED == 1)
#define BUTTON_LONG_PRESS_SAMPLE_MS           (50u)     /* Sample button level rate in milli seconds. */
#define BUTTON_LONG_PRESS_THRESHOLD_MS        (500u)    /* Long pression time threshold in milli seconds. */
#ifdef CFG_BSP_ON_CEB
#define BUTTON_NB_MAX                         (B2 + 1u)
#else /* CFG_BSP_ON_CEB */
#define BUTTON_NB_MAX                         (B3 + 1u)
#endif /* CFG_BSP_ON_CEB */
#endif /* (CFG_BUTTON_SUPPORTED == 1) */

#ifndef CFG_BSP_ON_SEQUENCER
#if (CFG_BUTTON_SUPPORTED == 1)
/* Push Button B1 Task related defines */
#define TASK_STACK_SIZE_BUTTON_B1             TASK_STACK_SIZE_BUTTON_Bx
#define TASK_PRIO_BUTTON_B1                   TASK_PRIO_BUTTON_Bx
#define TASK_PREEMP_BUTTON_B1                 TASK_PREEMP_BUTTON_Bx

/* Push Button B2 Task related defines */
#define TASK_STACK_SIZE_BUTTON_B2             TASK_STACK_SIZE_BUTTON_Bx
#define TASK_PRIO_BUTTON_B2                   TASK_PRIO_BUTTON_Bx
#define TASK_PREEMP_BUTTON_B2                 TASK_PREEMP_BUTTON_Bx

/* Push Button B3 Task related defines */
#define TASK_STACK_SIZE_BUTTON_B3             TASK_STACK_SIZE_BUTTON_Bx
#define TASK_PRIO_BUTTON_B3                   TASK_PRIO_BUTTON_Bx
#define TASK_PREEMP_BUTTON_B3                 TASK_PREEMP_BUTTON_Bx

#endif /* (CFG_BUTTON_SUPPORTED == 1) */
#if (CFG_JOYSTICK_SUPPORTED == 1)
/* Push Joystick Up Task related defines */
#define TASK_STACK_SIZE_JOYSTICK_UP           TASK_STACK_SIZE_JOYSTICK_x
#define TASK_PRIO_JOYSTICK_UP                 TASK_PRIO_JOYSTICK_x
#define TASK_PREEMP_JOYSTICK_UP               TASK_PREEMP_JOYSTICK_x

/* Push Joystick Right Task related defines */
#define TASK_STACK_SIZE_JOYSTICK_RIGHT        TASK_STACK_SIZE_JOYSTICK_x
#define TASK_PRIO_JOYSTICK_RIGHT              TASK_PRIO_JOYSTICK_x
#define TASK_PREEMP_JOYSTICK_RIGHT            TASK_PREEMP_JOYSTICK_x

/* Push Joystick Down Task related defines */
#define TASK_STACK_SIZE_JOYSTICK_DOWN         TASK_STACK_SIZE_JOYSTICK_x
#define TASK_PRIO_JOYSTICK_DOWN               TASK_PRIO_JOYSTICK_x
#define TASK_PREEMP_JOYSTICK_DOWN             TASK_PREEMP_JOYSTICK_x

/* Push Joystick Left Task related defines */
#define TASK_STACK_SIZE_JOYSTICK_LEFT         TASK_STACK_SIZE_JOYSTICK_x
#define TASK_PRIO_JOYSTICK_LEFT               TASK_PRIO_JOYSTICK_x
#define TASK_PREEMP_JOYSTICK_LEFT             TASK_PREEMP_JOYSTICK_x

/* Push Joystick Select Task related defines */
#define TASK_STACK_SIZE_JOYSTICK_SELECT       TASK_STACK_SIZE_JOYSTICK_x
#define TASK_PRIO_JOYSTICK_SELECT             TASK_PRIO_JOYSTICK_x
#define TASK_PREEMP_JOYSTICK_SELECT           TASK_PREEMP_JOYSTICK_x

/* Push Joystick None Task related defines */
#define TASK_STACK_SIZE_JOYSTICK_NONE         TASK_STACK_SIZE_JOYSTICK_x
#define TASK_PRIO_JOYSTICK_NONE               TASK_PRIO_JOYSTICK_x
#define TASK_PREEMP_JOYSTICK_NONE             TASK_PREEMP_JOYSTICK_x

#endif /* (CFG_JOYSTICK_SUPPORTED == 1) */
#endif /* CFG_BSP_ON_SEQUENCER */

#if (CFG_JOYSTICK_SUPPORTED == 1)
#define JOYSTICK_PRESS_SAMPLE_MS              (100u)    /* Sample Joystick level rate in milli seconds. */
#define JOYSTICK_LONG_PRESS_THRESHOLD_MS      (500u)      /* Long pression time threshold in milliseconds. */
//#define JOYSTICK_NONE_DETECT                  (0u)      
/* Indicate if a transition to 'None' is detected and launch an Action. 
   Caution : cannot be use if 'LongPress' Threadhosl is different of 0. */
#endif /* (CFG_JOYSTICK_SUPPORTED == 1) */

/* Private macros ------------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/
#if (CFG_JOYSTICK_SUPPORTED == 1)
  /* The ADC value gives the pad pressed. It's differents in function of DK board
  WBA55-DK1   WBA65-DK
  JOY_NONE    JOY_NONE  -> around 3,3V  -> ADC value around 4095.
  JOY_DOWN    JOY_RIGHT -> around 2.6V  -> ADC value around 3288.
  JOY_RIGHT   JOY_UP    -> around 2.0V  -> ADC value around 2494.
  JOY_LEFT    JOY_DOWN  -> around 1.3V  -> ADC value around 1638.
  JOY_UP      JOY_LEFT  -> around 0.6V  -> ADC value around 831.
  JOY_SEL     JOY_SEL   -> around 0V    -> ADC value around 0. */
#ifdef STM32WBA65xx
const JOYPin_TypeDef eJoystickStateList[] = { JOY_RIGHT, JOY_UP, JOY_DOWN, JOY_LEFT, JOY_SEL };
#else /* STM32WBA65xx */
const JOYPin_TypeDef eJoystickStateList[] = { JOY_DOWN, JOY_RIGHT, JOY_LEFT, JOY_UP, JOY_SEL };
#endif /* STM32WBA65xx */
#endif /* (CFG_JOYSTICK_SUPPORTED == 1) */
#ifdef CFG_BSP_ON_FREERTOS
#if (CFG_JOYSTICK_SUPPORTED == 1)
/* FreeRtos Joystick Up stack attributes */
const osThreadAttr_t JoystickUpThreadAttributes =
{
  .name         = "Joystick Up Thread",
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE,
  .stack_mem    = TASK_DEFAULT_STACK_MEM,
  .priority     = TASK_PRIO_JOYSTICK_UP,
  .stack_size   = TASK_STACK_SIZE_JOYSTICK_UP
};

/* FreeRtos Joystick Right stack attributes */
const osThreadAttr_t JoystickRightThreadAttributes =
{
  .name         = "Joystick Up Thread",
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE,
  .stack_mem    = TASK_DEFAULT_STACK_MEM,
  .priority     = TASK_PRIO_JOYSTICK_RIGHT,
  .stack_size   = TASK_STACK_SIZE_JOYSTICK_RIGHT
};

/* FreeRtos Joystick Down stack attributes */
const osThreadAttr_t JoystickDownThreadAttributes =
{
  .name         = "Joystick Down Thread",
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE,
  .stack_mem    = TASK_DEFAULT_STACK_MEM,
  .priority     = TASK_PRIO_JOYSTICK_DOWN,
  .stack_size   = TASK_STACK_SIZE_JOYSTICK_DOWN
};

/* FreeRtos Joystick Left stack attributes */
const osThreadAttr_t JoystickLeftThreadAttributes =
{
  .name         = "Joystick Left Thread",
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE,
  .stack_mem    = TASK_DEFAULT_STACK_MEM,
  .priority     = TASK_PRIO_JOYSTICK_LEFT,
  .stack_size   = TASK_STACK_SIZE_JOYSTICK_LEFT
};

/* FreeRtos Joystick Select stack attributes */
const osThreadAttr_t JoystickSelectThreadAttributes =
{
  .name         = "Joystick Select Thread",
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE,
  .stack_mem    = TASK_DEFAULT_STACK_MEM,
  .priority     = TASK_PRIO_JOYSTICK_SELECT,
  .stack_size   = TASK_STACK_SIZE_JOYSTICK_SELECT
};

