STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE_Thread/BLE_HeartRate_Thread_SED_FreeRTOS/STM32_WPAN/App/app_bsp.c
#if (CFG_JOYSTICK_SUPPORTED == 1)
#ifdef CFG_BSP_ON_DISCOVERY
  /* Joystick HW Initialization */
  BSP_JOY_Init( JOY1, JOY_MODE_EXTI, JOY_ALL );
#endif /* CFG_BSP_ON_DISCOVERY */
#endif /* (CFG_JOYSTICK_SUPPORTED == 1) */
  
#if (CFG_BUTTON_SUPPORTED == 1)
#ifdef CFG_BSP_ON_CEB
  /* Button HW Initialization */
  BSP_PB_Init( B2, BUTTON_MODE_EXTI );
#endif /* CFG_BSP_ON_CEB */

#ifdef CFG_BSP_ON_NUCLEO
  /* Buttons HW Initialization */
  BSP_PB_Init( B1, BUTTON_MODE_EXTI );
  BSP_PB_Init( B2, BUTTON_MODE_EXTI );
  BSP_PB_Init( B3, BUTTON_MODE_EXTI );
#endif /* CFG_BSP_ON_NUCLEO */
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
}

#if ( CFG_BUTTON_SUPPORTED == 1 )

/**
 * @brief   Indicate if the selected button was pressed during a 'long time' or not.
 *
 * @param   btnIdx    Button to test, listed in enum Button_TypeDef
 * @return  '1' if pressed during a 'long time', else '0'.
 */
uint8_t APP_BSP_ButtonIsLongPressed( uint16_t btnIdx )
{
  uint8_t pressStatus = 0;

  if ( btnIdx < BUTTON_NB_MAX )
  {
    pressStatus = buttonDesc[btnIdx].longPressed;
    buttonDesc[btnIdx].longPressed = 0;
  }

  return pressStatus;
}

/**
 * @brief   'Manually' set the selected button as pressed during a 'long time'.
 *
 * @param   btnIdx    Button to test, listed in enum Button_TypeDef
 */
void APP_BSP_SetButtonIsLongPressed( uint16_t btnIdx )
{
  buttonDesc[btnIdx].longPressed = 1;
}

/**
 * @brief  Action of button 1 when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_Button1Action( void )
{
}

/**
 * @brief  Action of button 2 when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_Button2Action( void )
{
}

/**
 * @brief  Action of button 3 when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_Button3Action( void )
{
}

#endif /* ( CFG_BUTTON_SUPPORTED == 1 )  */
#if ( CFG_JOYSTICK_SUPPORTED == 1 )

/**
 * @brief   Indicate if the current Joystick was pressed during a 'long time' or not.
 *
 * @return  '1' if pressed during a 'long time', else '0'.
 */
uint8_t APP_BSP_JoystickIsLongPressed( void )
{
  return cJoystickLongPressed;
}

/**
 * @brief   In UseCase '1' & '3', indicate if the current Joystick was pressed during a 'Short time' or not.
 *
 * @return  '1' if pressed during a 'Short time', else '0'.
 */
uint8_t APP_BSP_JoystickIsShortReleased( void )
{
  if ( cJoystickLongPressed == 0u )
  {
    return 1;
  }
  else
  {
    return 0;
  }
}


/**
 * @brief   In UseCase '1' & '3', indicate if the current Joystick was just pressed or not.
 *
 * @return  '1' if just pressed, else '0'.
 */
uint8_t APP_BSP_JoystickIsInitialPress( void )
{
  return cJoystickInitialPress;
}

/**
 * @brief  Action of Joystick UP when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_JoystickUpAction( void )
{
}

/**
 * @brief  Action of Joystick RIGHT when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_JoystickRightAction( void )
{
}

/**
 * @brief  Action of Joystick DOWN when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_JoystickDownAction( void )
{
}

/**
 * @brief  Action of Joystick LEFT when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_JoystickLeftAction( void )
{
}

/**
 * @brief  Action of Joystick SELECT when pressed, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_JoystickSelectAction( void )
{
}

/**
 * @brief  Action of Joystick when Joystick return to NONE after an Action, to be implemented by user.
 * @param  None
 * @retval None
 */
__WEAK void APP_BSP_JoystickNoneAction( void )
{
}

#endif /* ( CFG_JOYSTICK_SUPPORTED == 1 ) */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

#if ( CFG_LED_SUPPORTED == 1 )

/**
 * @brief  Initialisation of all LED on used boards.
 */
void APP_BSP_LedInit( void )
{
  /* Leds Initialization */
#if defined(CFG_BSP_ON_DISCOVERY) && defined(STM32WBA65xx)
  BSP_LED_Init(LED_GREEN);
  BSP_LED_Init(LED_RED);
#else /* defined(CFG_BSP_ON_DISCOVERY) && defined(STM32WBA65xx) */
  BSP_LED_Init(LED_BLUE);
#ifdef CFG_BSP_ON_NUCLEO 
  BSP_LED_Init(LED_GREEN);
  BSP_LED_Init(LED_RED);
#endif /* CFG_BSP_ON_NUCLEO */
#endif /* defined(CFG_BSP_ON_DISCOVERY) && defined(STM32WBA65xx) */
}

#endif /* (CFG_LED_SUPPORTED == 1) */
#ifdef CFG_BSP_ON_DISCOVERY
#if (CFG_LCD_SUPPORTED == 1)

/**
 * @brief  Initialisation of the LCD screen on used Discovery board.
 */
void APP_BSP_LcdInit( void )
{
  int32_t   iStatus;

  /* LCD Initialisation */
  iStatus = BSP_LCD_Init( LCD1, LCD_ORIENTATION_LANDSCAPE );
  if ( iStatus == BSP_ERROR_NONE )
  {
    iStatus = BSP_LCD_DisplayOn( LCD1 );
  }

  if ( iStatus == BSP_ERROR_NONE )
  {
    /* LCD Management Initialisation */
    UTIL_LCD_SetFuncDriver( &LCD_Driver );

    /* Clear the Background Layer */
    UTIL_LCD_Clear( LCD_COLOR_BLACK );

    /* Select font and Color */
    UTIL_LCD_SetFont( &Font12 );
    UTIL_LCD_SetBackColor( LCD_COLOR_BLACK );
    UTIL_LCD_SetTextColor( LCD_COLOR_WHITE );
  }
}

#endif /* (CFG_LCD_SUPPORTED == 1) */
#if (CFG_JOYSTICK_SUPPORTED == 1)

/**
 * @brief  Launch the Task selected by the joystick.
 *
 * @param  joystickState  position of joystick.
 * @retval None
 */
static void Joystick_LaunchActionTask( JOYPin_TypeDef joystickState )
{
  switch ( joystickState )
  {
#ifdef CFG_BSP_ON_FREERTOS
    case JOY_UP:
        osSemaphoreRelease( JoystickUpSemaphore );
        break;

    case JOY_RIGHT:
        osSemaphoreRelease( JoystickRightSemaphore );
        break;

    case JOY_DOWN:
        osSemaphoreRelease( JoystickDownSemaphore );
        break;

    case JOY_LEFT:
        osSemaphoreRelease( JoystickLeftSemaphore );
        break;

    case JOY_SEL:
        osSemaphoreRelease( JoystickSelectSemaphore );
        break;
        
    case JOY_NONE:
        osSemaphoreRelease( JoystickNoneSemaphore );
        break;
#endif /* CFG_BSP_ON_FREERTOS */
#ifdef CFG_BSP_ON_THREADX
    case JOY_UP:
        tx_semaphore_put( &JoystickUpSemaphore );
        break;

    case JOY_RIGHT:
        tx_semaphore_put( &JoystickRightSemaphore );
        break;

