STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE_Thread/BLE_HeartRate_Thread_SED_FreeRTOS/STM32_WPAN/App/app_bsp.c
    case JOY_DOWN:
        tx_semaphore_put( &JoystickDownSemaphore );
        break;

    case JOY_LEFT:
        tx_semaphore_put( &JoystickLeftSemaphore );
        break;

    case JOY_SEL:
        tx_semaphore_put( &JoystickSelectSemaphore );
        break;

    case JOY_NONE:
        tx_semaphore_put( JoystickNoneSemaphore );
        break;
#endif /* CFG_BSP_ON_THREADX */
#ifdef CFG_BSP_ON_SEQUENCER
    case JOY_UP:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_UP, CFG_SEQ_PRIO_0 );
        break;

    case JOY_RIGHT:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_RIGHT, CFG_SEQ_PRIO_0 );
        break;

    case JOY_DOWN:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_DOWN, CFG_SEQ_PRIO_0 );
        break;

    case JOY_LEFT:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_LEFT, CFG_SEQ_PRIO_0 );
        break;

    case JOY_SEL:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_SELECT, CFG_SEQ_PRIO_0 );
        break;
        
    case JOY_NONE:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_JOY_NONE, CFG_SEQ_PRIO_0 );
        break;
#endif /* CFG_BSP_ON_SEQUENCER */

    default :   /* No Action */
                break;
  }
}

/**
  * @brief  Get Joystick state.
  * @param  JOY Joystick.
  *   This parameter can be JOY1
  * @retval BSP error code if value negative or one of following value:
  *     @arg JOY_NONE
  *     @arg JOY_SEL
  *     @arg JOY_DOWN
  *     @arg JOY_LEFT
  *     @arg JOY_RIGHT
  *     @arg JOY_UP
  */
static JOYPin_TypeDef APP_BSP_JOY_GetState( JOY_TypeDef eJoy )
{
  JOYPin_TypeDef  eJoyPin;
  uint16_t        iKeyConvertedValue;

  /* Get the converted value of regular channel */
  iKeyConvertedValue = HAL_ADC_GetValue( &hjoy_adc[eJoy] );

  /* The ADC value gives the pad pressed.
  JOY_NONE  -> around 3,3V  -> ADC value around 4095.
  JOY_RIGHT -> around 2.6V  -> ADC value around 3288.
  JOY_UP    -> around 2.0V  -> ADC value around 2494.
  JOY_DOWN  -> around 1.3V  -> ADC value around 1638.
  JOY_LEFT  -> around 0.6V  -> ADC value around 831.
  JOY_SEL   -> around 0V    -> ADC value around 0. */

  if ( ( iKeyConvertedValue >= 2800U ) && ( iKeyConvertedValue < 3600U ) )
  {
    eJoyPin = JOY_RIGHT;
  }
  else if ( ( iKeyConvertedValue >= 2000U ) && ( iKeyConvertedValue < 2800U ) )
  {
    eJoyPin = JOY_UP;
  }
  else if ( ( iKeyConvertedValue >= 1200U ) && ( iKeyConvertedValue < 2000U ) )
  {
    eJoyPin = JOY_DOWN;
  }
  else if ( ( iKeyConvertedValue >= 400U ) && ( iKeyConvertedValue < 1200U ) )
  {
    eJoyPin = JOY_LEFT;
  }
  else if ( iKeyConvertedValue < 400U )
  {
    eJoyPin = JOY_SEL;
  }
  else
  {
    eJoyPin = JOY_NONE;
  }

  return eJoyPin;
}


/**
 *
 */
static void APP_BSP_JoystickTimerCallback(void *arg)
{
  static JOYPin_TypeDef   eJoystickPreviousState = JOY_NONE;
  JOYPin_TypeDef          eJoystickState;
#if (JOYSTICK_LONG_PRESS_THRESHOLD_MS != 0)
  static bool             bActionDone = false;
  static uint32_t         lStartTime = 0;
#endif /* (JOYSTICK_LONG_PRESS_THRESHOLD_MS != 0) */

  /* Init, Sample & DeInit Joystick */
  BSP_JOY_Init( JOY1, JOY_MODE_EXTI, JOY_ALL );

  /* Wait first conversion */
  HAL_ADC_PollForConversion( &hjoy_adc[JOY1], ( JOYSTICK_PRESS_SAMPLE_MS / 2u ) );
  eJoystickState = APP_BSP_JOY_GetState( JOY1 );

  BSP_JOY_DeInit(JOY1, JOY_ALL);

#if (JOYSTICK_LONG_PRESS_THRESHOLD_MS != 0)
  /* Process Joystick information. */
  if ( ( eJoystickState != JOY_NONE ) && ( eJoystickState == eJoystickPreviousState ) )
  {
    /* Verify if it's a LongTime */
    if ( bActionDone == false )
    {
      lStartTime += JOYSTICK_PRESS_SAMPLE_MS;
      if ( lStartTime > JOYSTICK_LONG_PRESS_THRESHOLD_MS )
      {
        cJoystickLongPressed = 1;
        bActionDone = true;
        cJoystickInitialPress = 0;
        Joystick_LaunchActionTask( eJoystickState );
      }
    }
  }
  else
  {
    if ( ( eJoystickState == JOY_NONE ) && ( eJoystickState != eJoystickPreviousState ) )
    {
      /* Verify if it's a 'Short Pressed' case */
      if ( ( lStartTime != 0u ) && ( bActionDone == false ) )
      {
        cJoystickInitialPress = 0;
        Joystick_LaunchActionTask( eJoystickPreviousState );
      }
    }
    else
    {
      cJoystickLongPressed = 0;
      cJoystickInitialPress = 0;
      bActionDone = false;
      lStartTime = 0;
    }
  }
#else /* (JOYSTICK_LONG_PRESS_THRESHOLD_MS != 0) */
  /* Process Joystick information. */
#if (JOYSTICK_NONE_DETECT != 0)
  if ( eJoystickState != eJoystickPreviousState )
#else /* (JOYSTICK_NONE_DETECT == 0) */
  if ( ( eJoystickState != JOY_NONE ) && ( eJoystickState != eJoystickPreviousState ) )
#endif /* (JOYSTICK_NONE_DETECT == 0) */
  {
    Joystick_LaunchActionTask( eJoystickState );
  }
#endif /* (JOYSTICK_LONG_PRESS_THRESHOLD_MS != 0) */
  
  eJoystickPreviousState = eJoystickState;

  /* Restart Timer if needed */
#if (CFG_LPM_STDBY_SUPPORTED != 0)
  if ( eJoystickState != JOY_NONE )
  {
    UTIL_TIMER_Start( &stJoystickTimer );
  }
#else /* (CFG_LPM_STDBY_SUPPORTED != 0) */
  UTIL_TIMER_Start( &stJoystickTimer );
#endif /* (CFG_LPM_STDBY_SUPPORTED != 0) */
}

#ifdef CFG_BSP_ON_FREERTOS

/**
 * @brief  Management of the Joystick Up task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickUpTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickUpSemaphore, osWaitForever );
    APP_BSP_JoystickUpAction();
  }
}

/**
 * @brief  Management of the Joystick Right task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickRightTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickRightSemaphore, osWaitForever );
    APP_BSP_JoystickRightAction();
  }
}

/**
 * @brief  Management of the Joystick Down task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickDownTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickDownSemaphore, osWaitForever );
    APP_BSP_JoystickDownAction();
  }
}

/**
 * @brief  Management of the Joystick Left task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickLeftTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickLeftSemaphore, osWaitForever );
    APP_BSP_JoystickLeftAction();
  }
}

/**
 * @brief  Management of the Joystick Select task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickSelectTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickSelectSemaphore, osWaitForever );
    APP_BSP_JoystickSelectAction();
  }
}

/**
 * @brief  Management of the Joystick None task
 * @param  argument  Not used.
 * @retval None
 */
static void JoystickNoneTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( JoystickNoneSemaphore, osWaitForever );
    APP_BSP_JoystickNoneAction();
  }
}

/**
 * @brief  Initialisation of the Joystick Tasks & Semaphores
 */
static void Joystick_InitTask( void )
{
  /* Register Semaphore & Task for the Joystick Up Semaphore */
  JoystickUpSemaphore = osSemaphoreNew( 1, 0, NULL );
  JoystickUpThread = osThreadNew( JoystickUpTask, NULL, &JoystickUpThreadAttributes );

  /* Register Semaphore & Task for the Joystick Up Semaphore */
  JoystickRightSemaphore = osSemaphoreNew( 1, 0, NULL );
  JoystickRightThread = osThreadNew( JoystickRightTask, NULL, &JoystickRightThreadAttributes );

  /* Register Semaphore & Task for the Joystick Up Semaphore */
  JoystickDownSemaphore = osSemaphoreNew( 1, 0, NULL );
  JoystickDownThread = osThreadNew( JoystickDownTask, NULL, &JoystickDownThreadAttributes );

  /* Register Semaphore & Task for the Joystick Up Semaphore */
  JoystickLeftSemaphore = osSemaphoreNew( 1, 0, NULL );
  JoystickLeftThread = osThreadNew( JoystickLeftTask, NULL, &JoystickLeftThreadAttributes );

  /* Register Semaphore & Task for the Joystick Select Semaphore */
  JoystickSelectSemaphore = osSemaphoreNew( 1, 0, NULL );
  JoystickSelectThread = osThreadNew( JoystickSelectTask, NULL, &JoystickSelectThreadAttributes );

