STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE_Thread/BLE_HeartRate_Thread_SED_FreeRTOS/STM32_WPAN/App/app_bsp.c
  /* Register Semaphore & Task for the Joystick None Semaphore */
  JoystickNoneSemaphore = osSemaphoreNew( 1, 0, NULL );
  JoystickNoneThread = osThreadNew( JoystickNoneTask, NULL, &JoystickNoneThreadAttributes );

  if ( ( JoystickUpSemaphore == NULL ) || ( JoystickRightSemaphore == NULL ) || ( JoystickDownSemaphore == NULL )
      || ( JoystickLeftSemaphore == NULL ) || ( JoystickSelectSemaphore == NULL ) || ( JoystickNoneSemaphore == NULL ) )
  {
    LOG_ERROR_APP( "FreeRtos : Error during creation of Semaphore for Joystick" );
    while(1);
  }

  if ( ( JoystickUpThread == NULL ) || ( JoystickRightThread == NULL ) || ( JoystickDownThread == NULL )
      || ( JoystickLeftThread == NULL ) || ( JoystickSelectThread == NULL ) || ( JoystickNoneThread == NULL ) )
  {
    LOG_ERROR_APP( "FreeRtos : Error during creation of Task for Joystick" );
    while(1);
  }
}

#endif /* CFG_BSP_ON_FREERTOS */
#ifdef CFG_BSP_ON_THREADX

/**
 * @brief  Management of the Joystick Up task
 * @param  lArgument  Not used.
 * @retval None
 */
static void JoystickUpTask( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &JoystickUpSemaphore, TX_WAIT_FOREVER );
    APP_BSP_JoystickUpAction();
  }
}

/**
 * @brief  Management of the Joystick Right task
 * @param  lArgument  Not used.
 * @retval None
 */
static void JoystickRightTask( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &JoystickRightSemaphore, TX_WAIT_FOREVER );
    APP_BSP_JoystickRigthAction();
  }
}

/**
 * @brief  Management of the Joystick Down task
 * @param  lArgument  Not used.
 * @retval None
 */
static void JoystickDownTask( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &JoystickDownSemaphore, TX_WAIT_FOREVER );
    APP_BSP_JoystickDownAction();
  }
}

/**
 * @brief  Management of the Joystick Left task
 * @param  lArgument  Not used.
 * @retval None
 */
static void JoystickLeftTask( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &JoystickLeftSemaphore, TX_WAIT_FOREVER );
    APP_BSP_JoystickLeftAction();
  }
}

/**
 * @brief  Management of the Joystick Select task
 * @param  lArgument  Not used.
 * @retval None
 */
static void JoystickSelectTask( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &JoystickSelectSemaphore, TX_WAIT_FOREVER );
    APP_BSP_JoystickSelectAction();
  }
}

/**
 * @brief  Management of the Joystick None task
 * @param  lArgument  Not used.
 * @retval None
 */
static void JoystickNoneTask( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &JoystickNoneSemaphore, TX_WAIT_FOREVER );
    APP_BSP_JoystickNoneAction();
  }
}

/**
 * @brief  Initialisation of the Joystick Tasks & Semaphores
 */
static void Joystick_InitTask( void )
{
  UINT    ThreadXStatus;
  CHAR    *pStack;

  /* Register Semaphore to launch the Joystick Up Task */
  ThreadXStatus = tx_semaphore_create( &JoystickUpSemaphore, "JoystickUp Semaphore", 0 );
  ThreadXStatus |= tx_byte_allocate( pBytePool, (VOID**) &pStack, TASK_STACK_SIZE_JOYSTICK_UP, TX_NO_WAIT);
  if ( ThreadXStatus == TX_SUCCESS )
  {
    ThreadXStatus = tx_thread_create( &JoystickUpThread, "JoystickUp Thread", JoystickUpTask, 0, pStack,
                                      TASK_STACK_SIZE_JOYSTICK_UP, TASK_PRIO_JOYSTICK_UP, TASK_PREEMP_JOYSTICK_UP,
                                      TX_NO_TIME_SLICE, TX_AUTO_START );
  }

  /* Register Semaphore to launch the Joystick Right Task */
  f ( ThreadXStatus == TX_SUCCESS )
  {
    ThreadXStatus = tx_semaphore_create( &JoystickRightSemaphore, "JoystickRight Semaphore", 0 );
    ThreadXStatus |= tx_byte_allocate( pBytePool, (VOID**) &pStack, TASK_STACK_SIZE_JOYSTICK_RIGHT, TX_NO_WAIT);
    if ( ThreadXStatus == TX_SUCCESS )
    {
      ThreadXStatus = tx_thread_create( &JoystickRightThread, "JoystickRight Thread", JoystickRightTask, 0, pStack,
                                        TASK_STACK_SIZE_JOYSTICK_RIGHT, TASK_PRIO_JOYSTICK_RIGHT, TASK_PREEMP_JOYSTICK_RIGHT,
                                        TX_NO_TIME_SLICE, TX_AUTO_START );
    }
  }

  /* Register Semaphore to launch the Joystick Down Task */
  f ( ThreadXStatus == TX_SUCCESS )
  {
    ThreadXStatus = tx_semaphore_create( &JoystickDownSemaphore, "JoystickDown Semaphore", 0 );
    ThreadXStatus |= tx_byte_allocate( pBytePool, (VOID**) &pStack, TASK_STACK_SIZE_JOYSTICK_DOWN, TX_NO_WAIT);
    if ( ThreadXStatus == TX_SUCCESS )
    {
      ThreadXStatus = tx_thread_create( &JoystickDownThread, "JoystickDown Thread", JoystickDownTask, 0, pStack,
                                        TASK_STACK_SIZE_JOYSTICK_DOWN, TASK_PRIO_JOYSTICK_DOWN, TASK_PREEMP_JOYSTICK_DOWN,
                                        TX_NO_TIME_SLICE, TX_AUTO_START );
    }
  }

  /* Register Semaphore to launch the Joystick Left Task */
  if ( ThreadXStatus == TX_SUCCESS )
  {
    ThreadXStatus = tx_semaphore_create( &JoystickLeftSemaphore, "JoystickLeft Semaphore", 0 );
    ThreadXStatus |= tx_byte_allocate( pBytePool, (VOID**) &pStack, TASK_STACK_SIZE_JOYSTICK_LEFT, TX_NO_WAIT);
    if ( ThreadXStatus == TX_SUCCESS )
    {
      ThreadXStatus = tx_thread_create( &JoystickLeftThread, "JoystickLeft Thread", JoystickLeftTask, 0, pStack,
                                        TASK_STACK_SIZE_JOYSTICK_LEFT, TASK_PRIO_JOYSTICK_LEFT, TASK_PREEMP_JOYSTICK_LEFT,
                                        TX_NO_TIME_SLICE, TX_AUTO_START );
    }
  }

  /* Register Semaphore to launch the Joystick Select Task */
  if ( ThreadXStatus == TX_SUCCESS )
  {
    ThreadXStatus = tx_semaphore_create( &JoystickSelectSemaphore, "JoystickSelect Semaphore", 0 );
    ThreadXStatus |= tx_byte_allocate( pBytePool, (VOID**) &pStack, TASK_STACK_SIZE_JOYSTICK_SELECT, TX_NO_WAIT);
    if ( ThreadXStatus == TX_SUCCESS )
    {
      ThreadXStatus = tx_thread_create( &JoystickSelectThread, "JoystickSelect Thread", JoystickSelectTask, 0, pStack,
                                        TASK_STACK_SIZE_JOYSTICK_SELECT, TASK_PRIO_JOYSTICK_SELECT, TASK_PREEMP_JOYSTICK_SELECT,
                                        TX_NO_TIME_SLICE, TX_AUTO_START );
    }
  }

  /* Register Semaphore to launch the Joystick None Task */
  if ( ThreadXStatus == TX_SUCCESS )
  {
    ThreadXStatus = tx_semaphore_create( &JoystickNoneSemaphore, "JoystickSNone Semaphore", 0 );
    ThreadXStatus |= tx_byte_allocate( pBytePool, (VOID**) &pStack, TASK_STACK_SIZE_JOYSTICK_NONE, TX_NO_WAIT);
    if ( ThreadXStatus == TX_SUCCESS )
    {
      ThreadXStatus = tx_thread_create( &JoystickNoneThread, "JoystickNone Thread", JoystickNoneTask, 0, pStack,
                                        TASK_STACK_SIZE_JOYSTICK_NONE, TASK_PRIO_JOYSTICK_NONE, TASK_PREEMP_JOYSTICK_NONE,
                                        TX_NO_TIME_SLICE, TX_AUTO_START );
    }
  }
  
  /* Verify if it's OK */
  if ( ThreadXStatus != TX_SUCCESS )
  {
    LOG_ERROR_APP( "ThreadX : Error during the creation of Semaphore & Task for Joystick (0x%04X)", ThreadXStatus );
    while(1);
  }
}

