STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE_Thread/BLE_HeartRate_Thread_SED_FreeRTOS/STM32_WPAN/App/app_bsp.c
#endif /* CFG_BSP_ON_THREADX */
#ifdef CFG_BSP_ON_SEQUENCER

/**
 * @brief  Initialisation of the Joystick Tasks & Semaphores
 */
static void Joystick_InitTask( void)
{
  /* Task associated with Joystick */
  UTIL_SEQ_RegTask( 1U << CFG_TASK_BSP_JOY_UP, UTIL_SEQ_RFU, APP_BSP_JoystickUpAction );
  UTIL_SEQ_RegTask( 1U << CFG_TASK_BSP_JOY_RIGHT, UTIL_SEQ_RFU, APP_BSP_JoystickRightAction );
  UTIL_SEQ_RegTask( 1U << CFG_TASK_BSP_JOY_DOWN, UTIL_SEQ_RFU, APP_BSP_JoystickDownAction );
  UTIL_SEQ_RegTask( 1U << CFG_TASK_BSP_JOY_LEFT, UTIL_SEQ_RFU, APP_BSP_JoystickLeftAction );
  UTIL_SEQ_RegTask( 1U << CFG_TASK_BSP_JOY_SELECT, UTIL_SEQ_RFU, APP_BSP_JoystickSelectAction );
  UTIL_SEQ_RegTask( 1U << CFG_TASK_BSP_JOY_NONE, UTIL_SEQ_RFU, APP_BSP_JoystickNoneAction );
}

#endif /* CFG_BSP_ON_SEQUENCER */

/**
 * @brief  Initialisation of the Joystick
 */
void APP_BSP_JoystickInit( void )
{
  /* Button task initialisation */
  Joystick_InitTask();
  cJoystickLongPressed = 0;

#if (CFG_LPM_STDBY_SUPPORTED != 0)
  /* StandBy WakeUp via Joystick */
#ifdef STM32WBA65xx
  HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN5_LOW_1);     /* JOY-PA3 */
#else // STM32WBA65xx
  HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN3_LOW_1);     /* JOY-PA1. */
#endif // STM32WBA65xx  
#endif /* (CFG_LPM_STDBY_SUPPORTED != 0) */

  /* Create periodic timer for joystick position reading */
  UTIL_TIMER_Create(&stJoystickTimer, JOYSTICK_PRESS_SAMPLE_MS, UTIL_TIMER_PERIODIC, &APP_BSP_JoystickTimerCallback, 0);
  UTIL_TIMER_Start(&stJoystickTimer);
}

#endif /* (CFG_JOYSTICK_SUPPORTED == 1) */
#endif /* CFG_BSP_ON_DISCOVERY */
#if ( CFG_BUTTON_SUPPORTED == 1 )
#ifdef CFG_BSP_ON_FREERTOS

/**
 * @brief  Management of the B1 pushbutton task
 * @param  argument  Not used.
 * @retval None
 */
static void ButtonB1Task( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( ButtonB1Semaphore, osWaitForever );
    APP_BSP_Button1Action();
  }
}

/**
 * @brief  Management of the B2 pushbutton task
 * @param  argument  Not used.
 * @retval None
 */
static void ButtonB2Task( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( ButtonB2Semaphore, osWaitForever );
    APP_BSP_Button2Action();
  }
}

/**
 * @brief  Management of the B3 pushbutton task
 * @param  argument  Not used.
 * @retval None
 */
static void ButtonB3Task( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( ButtonB3Semaphore, osWaitForever );
    APP_BSP_Button3Action();
  }
}

static void Button_InitTask( void )
{
  /* Register Semaphore & Thread to launch the pushbutton B1 Task */
  ButtonB1Semaphore = osSemaphoreNew( 1, 0, NULL );
  ButtonB1Thread = osThreadNew( ButtonB1Task, NULL, &ButtonB1ThreadAttributes );

  /* Register Semaphore & Thread to launch the pushbutton B2 Task */
  ButtonB2Semaphore = osSemaphoreNew( 1, 0, NULL );
  ButtonB2Thread = osThreadNew( ButtonB2Task, NULL, &ButtonB2ThreadAttributes );

  /* Register Semaphore & Thread to launch the pushbutton B3 Task */
  ButtonB3Semaphore = osSemaphoreNew( 1, 0, NULL );
  ButtonB3Thread = osThreadNew( ButtonB3Task, NULL, &ButtonB3ThreadAttributes );

  if ( ( ButtonB1Semaphore == NULL ) || ( ButtonB2Semaphore == NULL ) || ( ButtonB3Semaphore == NULL ) )
  {
    LOG_ERROR_APP( "FreeRtos : Error during creation of Semaphore for Buttons" );
    while(1);
  }

  if ( ( ButtonB1Thread == NULL ) || ( ButtonB2Thread == NULL ) || ( ButtonB3Thread == NULL ) )
  {
    LOG_ERROR_APP( "FreeRtos : Error during creation of Thread for Buttons" );
    while(1);
  }
}

#endif /* CFG_BSP_ON_FREERTOS */
#ifdef CFG_BSP_ON_THREADX

/**
 * @brief  Management of the B1 pushbutton task
 * @param  lArgument  Not used.
 * @retval None
 */
static void ButtonB1Task( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &ButtonB1Semaphore, TX_WAIT_FOREVER );
    APP_BSP_Button1Action();
  }
}

/**
 * @brief  Management of the B2 pushbutton task
 * @param  lArgument  Not used.
 * @retval None
 */
static void ButtonB2Task( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &ButtonB2Semaphore, TX_WAIT_FOREVER );
    APP_BSP_Button2Action();
  }
}

/**
 * @brief  Management of the B3 pushbutton task
 * @param  lArgument  Not used.
 * @retval None
 */
static void ButtonB3Task( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &ButtonB3Semaphore, TX_WAIT_FOREVER );
    APP_BSP_Button3Action();
  }
}

static void Button_InitTask( void )
{
  UINT    ThreadXStatus;
  CHAR    *pStack;

  /* Register Semaphore to launch the pushbutton B1 Task */
  ThreadXStatus = tx_semaphore_create( &ButtonB1Semaphore, "ButtonB1 Semaphore", 0 );
  ThreadXStatus |= tx_byte_allocate( pBytePool, (VOID**) &pStack, TASK_STACK_SIZE_BUTTON_B1, TX_NO_WAIT);
  if ( ThreadXStatus == TX_SUCCESS )
  {
    ThreadXStatus = tx_thread_create( &ButtonB1Thread, "ButtonB1 Thread", ButtonB1Task, 0, pStack,
                                      TASK_STACK_SIZE_BUTTON_B1, TASK_PRIO_BUTTON_B1, TASK_PREEMP_BUTTON_B1,
                                      TX_NO_TIME_SLICE, TX_AUTO_START );
  }

  /* Register Semaphore to launch the pushbutton B2 Task */
  if ( ThreadXStatus == TX_SUCCESS )
  {
    ThreadXStatus = tx_semaphore_create( &ButtonB2Semaphore, "ButtonB2 Semaphore", 0 );
    ThreadXStatus |= tx_byte_allocate( pBytePool, (VOID**) &pStack, TASK_STACK_SIZE_BUTTON_B2, TX_NO_WAIT);
    if ( ThreadXStatus == TX_SUCCESS )
    {
      ThreadXStatus = tx_thread_create( &ButtonB2Thread, "ButtonB2 Thread", ButtonB2Task, 0, pStack,
                                        TASK_STACK_SIZE_BUTTON_B2, TASK_PRIO_BUTTON_B2, TASK_PREEMP_BUTTON_B2,
                                        TX_NO_TIME_SLICE, TX_AUTO_START );
    }
  }

  /* Register Semaphore to launch the pushbutton B3 Task */
  if ( ThreadXStatus == TX_SUCCESS )
  {
    ThreadXStatus = tx_semaphore_create( &ButtonB3Semaphore, "ButtonB3 Semaphore", 0 );
    ThreadXStatus = tx_byte_allocate( pBytePool, (VOID**) &pStack, TASK_STACK_SIZE_BUTTON_B3, TX_NO_WAIT);
    if ( ThreadXStatus == TX_SUCCESS )
    {
      ThreadXStatus = tx_thread_create( &ButtonB3Thread, "ButtonB3 Thread", ButtonB3Task, 0, pStack,
                                        TASK_STACK_SIZE_BUTTON_B3, TASK_PRIO_BUTTON_B3, TASK_PREEMP_BUTTON_B3,
                                        TX_NO_TIME_SLICE, TX_AUTO_START );
    }
  }

  /* Verify if it's OK */
  if ( ThreadXStatus != TX_SUCCESS )
  {
    LOG_ERROR_APP( "ThreadX : Error during the creation of Semaphore & Task for Buttons (0x%04X)", ThreadXStatus );
    while(1);
  }
}

