STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE_Thread/BLE_HeartRate_Thread_SED_FreeRTOS/STM32_WPAN/App/app_bsp.c
#endif /* CFG_BSP_ON_THREADX */
#ifdef CFG_BSP_ON_SEQUENCER

/**
 * @brief  Initialisation of Buttons Tasks & Semaphores
 */
static void Button_InitTask( void )
{
#ifdef CFG_BSP_ON_CEB
  /* Task associated with push button B2 */
  UTIL_SEQ_RegTask( 1U << CFG_TASK_BSP_BUTTON_B2, UTIL_SEQ_RFU, APP_BSP_Button2Action );
#else /* CFG_BSP_ON_CEB */
  /* Task associated with push button B1 */
  UTIL_SEQ_RegTask( 1U << CFG_TASK_BSP_BUTTON_B1, UTIL_SEQ_RFU, APP_BSP_Button1Action );

  /* Task associated with push button B2 */
  UTIL_SEQ_RegTask( 1U << CFG_TASK_BSP_BUTTON_B2, UTIL_SEQ_RFU, APP_BSP_Button2Action );

  /* Task associated with push button B3 */
  UTIL_SEQ_RegTask( 1U << CFG_TASK_BSP_BUTTON_B3, UTIL_SEQ_RFU, APP_BSP_Button3Action );
#endif /* CFG_BSP_ON_CEB */
}

#endif /* CFG_BSP_ON_SEQUENCER */

/**
 * @brief  Initialisation of Buttons
 */
void APP_BSP_ButtonInit( void )
{
  Button_TypeDef  buttonIndex;

  /* Buttons HW Initialization */
#ifdef CFG_BSP_ON_CEB
  BSP_PB_Init( B2, BUTTON_MODE_EXTI );
#endif /* CFG_BSP_ON_CEB */
#ifdef CFG_BSP_ON_NUCLEO
  BSP_PB_Init( B1, BUTTON_MODE_EXTI );
  BSP_PB_Init( B2, BUTTON_MODE_EXTI );
  BSP_PB_Init( B3, BUTTON_MODE_EXTI );

#if (CFG_LPM_STDBY_SUPPORTED != 0)
  /* StandBy WakeUp via buttons */
  HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN2_LOW_1);   /* WakeUp on B1 - GPIO PC13. */
#ifdef STM32WBA65xx
  SET_BIT(PWR->IORETENRC, ( B1_PIN | B2_PIN ) );    /* Retention for B1 & B2 */       
  SET_BIT(PWR->IORETENRB, B3_PIN);                  /* Retention for B3 */
#else /* STM32WBA65xx */
  SET_BIT(PWR->IORETENRC, B1_PIN );                 /* Retention for B1 */       
  SET_BIT(PWR->IORETENRB, ( B2_PIN | B3_PIN ) );    /* Retention for B2 & B3 */
#endif /* STM32WBA65xx  */
#endif /* (CFG_LPM_STDBY_SUPPORTED != 0)   */
#endif /* CFG_BSP_ON_NUCLEO */

  /* Button task initialisation */
  Button_InitTask();

  /* StandBy WakeUp via buttons */
  HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN2_HIGH_1);              /* GPIO PC13. */

  /* Button timers initialisation (one for each button) */
#ifdef CFG_BSP_ON_CEB
  buttonIndex = B2;
  UTIL_TIMER_Create( &buttonDesc[buttonIndex].longTimerId, 0, UTIL_TIMER_PERIODIC, &Button_TriggerActions, &buttonDesc[buttonIndex] );
#else /* CFG_BSP_ON_CEB */
  for ( buttonIndex = B1; buttonIndex < BUTTON_NB_MAX; buttonIndex++ )
  {
    UTIL_TIMER_Create( &buttonDesc[buttonIndex].longTimerId, 0, UTIL_TIMER_PERIODIC, &Button_TriggerActions, &buttonDesc[buttonIndex] );
  }
#endif /* CFG_BSP_ON_CEB */
}

/**
 * @brief  Launch the Task selected by the button.
 *
 * @param  button  ID of pressed button.
 * @retval None
 */
static void Button_LaunchActionTask( Button_TypeDef button )
{
#ifdef CFG_BSP_ON_CEB
  if ( button == B2 )
  {
#ifdef CFG_BSP_ON_FREERTOS
    osSemaphoreRelease( ButtonB2Semaphore );
#endif /* CFG_BSP_ON_FREERTOS */
#ifdef CFG_BSP_ON_THREADX
    tx_semaphore_put( &ButtonB2Semaphore );
#endif /* CFG_BSP_ON_THREADX */
#ifdef CFG_BSP_ON_SEQUENCER
    UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_BUTTON_B2, CFG_SEQ_PRIO_0 );
#endif /* CFG_BSP_ON_SEQUENCER */
  }
#endif /* CFG_BSP_ON_CEB */
#ifdef CFG_BSP_ON_NUCLEO
  switch ( button )
  {
#ifdef CFG_BSP_ON_FREERTOS
    case B1:
        osSemaphoreRelease( ButtonB1Semaphore );
        break;

    case B2:
        osSemaphoreRelease( ButtonB2Semaphore );
        break;

    case B3:
        osSemaphoreRelease( ButtonB3Semaphore );
        break;
#endif /* CFG_BSP_ON_FREERTOS */
#ifdef CFG_BSP_ON_THREADX
    case B1:
        tx_semaphore_put( &ButtonB1Semaphore );
        break;

    case B2:
        tx_semaphore_put( &ButtonB2Semaphore );
        break;

    case B3:
        tx_semaphore_put( &ButtonB3Semaphore );
        break;
#endif /* CFG_BSP_ON_THREADX */
#ifdef CFG_BSP_ON_SEQUENCER
    case B1:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_BUTTON_B1, CFG_SEQ_PRIO_0 );
        break;

    case B2:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_BUTTON_B2, CFG_SEQ_PRIO_0 );
        break;

    case B3:
        UTIL_SEQ_SetTask( 1U << CFG_TASK_BSP_BUTTON_B3, CFG_SEQ_PRIO_0 );
        break;
#endif /* CFG_BSP_ON_SEQUENCER */

    default:
        break;
  }
#endif /* CFG_BSP_ON_NUCLEO */
}

/**
 *
 */
static void Button_TriggerActions( void * arg )
{
  ButtonDesc_t    * p_buttonDesc = arg;
  int32_t         buttonState = 0;

  buttonState = BSP_PB_GetState( p_buttonDesc->button );

  /* If Button pressed and Threshold time not finish, continue waiting */
  p_buttonDesc->waitingTime += BUTTON_LONG_PRESS_SAMPLE_MS;
  if ( ( buttonState != 0u ) && ( p_buttonDesc->waitingTime < BUTTON_LONG_PRESS_THRESHOLD_MS ) )
  {
    return;
  }

  /* Save button state */
  if ( buttonState != 0u )
  {
    APP_BSP_SetButtonIsLongPressed( p_buttonDesc->button );
  }

  /* Stop Timer */
  UTIL_TIMER_Stop( &p_buttonDesc->longTimerId );

  /* Launch Task */
  Button_LaunchActionTask( p_buttonDesc->button );
}

/**
 *
 */
void BSP_PB_Callback( Button_TypeDef button )
{
  buttonDesc[button].waitingTime = 0;
  UTIL_TIMER_StartWithPeriod( &buttonDesc[button].longTimerId, BUTTON_LONG_PRESS_SAMPLE_MS );
}

#endif /* ( CFG_BUTTON_SUPPORTED == 1 )  */

/**
 * @brief  Treat USART commands to simulate button press for instance.
 *
 * @param  pRxBuffer      Pointer on received data from USART.
 * @param  iRxBufferSize  Number of received data.
 * @retval 1 if function can be execute a command else 0.
 */
uint8_t APP_BSP_SerialCmdExecute( uint8_t * pRxBuffer, uint16_t iRxBufferSize )
{
  uint8_t   cReturn = 0;
  uint16_t  iUserChoice = UINT16_MAX;

  /* Parse received frame */
#if ( CFG_BUTTON_SUPPORTED == 1 )
#ifdef CFG_BSP_ON_CEB
  /* For Board B_WBA5M_WPAN, the only button (same as B1 on other board) is named B2. */
  if ( (strcmp( (char const*)pRxBuffer, "B2" ) == 0) ||
       (strcmp( (char const*)pRxBuffer, "SW2" ) == 0) )
  {
    iUserChoice = B2;
  }
  else if ( (strcmp( (char const*)pRxBuffer, "B2L" ) == 0) ||
            (strcmp( (char const*)pRxBuffer, "SW2L" ) == 0) )
  {
    APP_BSP_SetButtonIsLongPressed(B2);
    iUserChoice = B2;
  }
#else /* CFG_BSP_ON_CEB */
  if ( (strcmp( (char const*)pRxBuffer, "B1" ) == 0) ||
       (strcmp( (char const*)pRxBuffer, "SW1" ) == 0) )
  {
    iUserChoice = B1;
  }
  else if ( (strcmp( (char const*)pRxBuffer, "B1L" ) == 0) ||
            (strcmp( (char const*)pRxBuffer, "SW1L" ) == 0) )
  {
    APP_BSP_SetButtonIsLongPressed(B1);
    iUserChoice = B1;
  }
  else if ( (strcmp( (char const*)pRxBuffer, "B2" ) == 0) ||
            (strcmp( (char const*)pRxBuffer, "SW2" ) == 0) )
  {
    iUserChoice = B2;
  }
  else if ( (strcmp( (char const*)pRxBuffer, "B2L" ) == 0) ||
            (strcmp( (char const*)pRxBuffer, "SW2L" ) == 0) )
  {
    APP_BSP_SetButtonIsLongPressed(B2);
    iUserChoice = B2;
  }
  else if ( (strcmp( (char const*)pRxBuffer, "B3" ) == 0) ||
            (strcmp( (char const*)pRxBuffer, "SW3" ) == 0) )
  {
    iUserChoice = B3;
  }
  else if ( (strcmp( (char const*)pRxBuffer, "B3L" ) == 0) ||
            (strcmp( (char const*)pRxBuffer, "SW3L" ) == 0) )
  {
    APP_BSP_SetButtonIsLongPressed(B3);
    iUserChoice = B3;
  }
#endif /* CFG_BSP_ON_CEB */
#endif /* ( CFG_BUTTON_SUPPORTED == 1 )  */
#if ( CFG_JOYSTICK_SUPPORTED == 1 )
  if (strcmp( (char const*)pRxBuffer, "UP" ) == 0)
  {
    iUserChoice = JOY_UP;
  }
  else if (strcmp( (char const*)pRxBuffer, "RIGHT" ) == 0)
  {
    iUserChoice = JOY_RIGHT;
  }
  else if (strcmp( (char const*)pRxBuffer, "DOWN" ) == 0 )
  {
    iUserChoice = JOY_DOWN;
  }
  else if (strcmp( (char const*)pRxBuffer, "LEFT" ) == 0)
  {
    iUserChoice = JOY_LEFT;
  }
  else if (strcmp( (char const*)pRxBuffer, "SELECT" ) == 0)
  {
    iUserChoice = JOY_SEL;
  }
#endif /* ( CFG_JOYSTICK_SUPPORTED == 1 )  */

  if ( iUserChoice != UINT16_MAX )
  {
    /* Launch Command */
    LOG_INFO_APP( "%s pressed by Serial Command.", pRxBuffer );
#if ( CFG_BUTTON_SUPPORTED == 1 )
    Button_LaunchActionTask( (Button_TypeDef)iUserChoice );
#endif /* ( CFG_BUTTON_SUPPORTED == 1 ) */
#if ( CFG_JOYSTICK_SUPPORTED == 1 )
    Joystick_LaunchActionTask( (JOYPin_TypeDef)iUserChoice );
#endif /* ( CFG_JOYSTICK_SUPPORTED == 1 ) */
    cReturn = 1;
  }

  return cReturn;
}

